#+title: Todo

Work Todos

* PR Reviews
:LOGBOOK:
CLOCK: [2024-09-05 Thu 09:40]--[2024-09-05 Thu 09:59] =>  0:19
:END:
* DoseSpot [11/11]
** [X] WE-696: DoseSpot V2 JSON
:LOGBOOK:
CLOCK: [2024-06-03 Mon 09:48]--[2024-06-03 Mon 10:13] =>  0:25
:END:
** [X] [[https://hellowisp.atlassian.net/browse/WISPENG-125][WISPENG-125]]: Use 'GetMedicationByNDC' instead of 'GetMedicationByNameAndStrength' for DoseSpot V2
** NO [[https://hellowisp.atlassian.net/browse/WISPENG-260][WISPENG-260]]: Combine "GenericProductName" and "GenericDrugName"
- Note taken on [2024-06-10 Mon 13:20] \\
  Won't do. There is no equivalent for "GenericProductName" in DoseSpot V2.
- Note taken on [2024-06-10 Mon 11:32] \\
  We may not need to do this one, depending on what DoseSpot says.
** [X] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4259][WISPENG-266]]: Adds metadata check in dispensable_drug_id property
- Note taken on [2024-06-07 Fri 15:02] \\
  Currently in draft. Publish it on Monday morning and get reviews.
** [X] Prepare for the DoseSpot call on 2024-06-10 by checking the V1 vs V2 changes for generic product name
:LOGBOOK:
CLOCK: [2024-06-10 Mon 11:18]--[2024-06-10 Mon 11:31] =>  0:13
CLOCK: [2024-06-10 Mon 10:46]--[2024-06-10 Mon 11:11] =>  0:25
CLOCK: [2024-06-10 Mon 10:10]--[2024-06-10 Mon 10:35] =>  0:25
:END:
** [X] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4265][WISPENG-268]]: When getting a medication by RxCUI in V2, ~DrugName~ is null in service response, but not in API JSON response.
:LOGBOOK:
CLOCK: [2024-06-10 Mon 11:52]--[2024-06-10 Mon 12:17] =>  0:25
:END:
- Note taken on [2024-06-10 Mon 11:35] \\
  Need tests for this. Tests should have failed before when this didn't work.
** [X] [[https://hellowisp.atlassian.net/browse/WISPENG-270][WISPENG-270]]: DoseSpotAPIMedicationV2 should accept 'RXCUI' and 'RxCUI'
** [X] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4270][WISPENG-271]]: Adds guard clause to dosespot_drug_metadata property
** [X] Ask if we can get a provider onboard for the DoseSpot launch
- Note taken on [2024-06-20 Thu 14:05] \\
  Andrea will help us out here
** [X] Write a release plan for DoseSpot V2
*** [X] Rollback plan?
*** [X] Schedule of what's going to happen
*** [X] What's important to us?
*** [X] How do we make sure everything worked?
*** [X] Who is going to be doing tests, quick fixes?
*** [X] Section of metrics that we will be watching
**** [X] Find a dashboard in Datadog for fill requests
*** [X] Post-release plan
*** [X] Document the need to change the feature flag
*** [X] Docuement the need to change the subscription key
** [20/20] Document all possible Patient uses of the DoseSpot API
*** [X] CancelPrescription
*** [X] CopyPrescription
*** [X] CreateCodedFillRequestRx
*** [X] CreateFreeTextFillRequestRx
*** [X] CreateOrUpdatePatient
*** [X] DeletePendingRx
*** [X] GetClinicianAddress
*** [X] GetMedicationByNameAndStrength
*** [X] GetMedicationByNDC
*** [X] GetMedicationByRxcui
- Note taken on [2024-06-20 Thu 14:22] \\
  Check ~assert_dosespot_metadata~ usages.
*** [X] GetMedicationMonograph
*** [X] GetNotificationsCounts
*** [X] GetPatientPrescription
*** [X] GetPatientPrescriptions
*** [X] GetPharmacy
*** [X] GetSsoUrl
*** [X] SearchMedicationsByName
*** [X] SearchPharmacies
*** [X] SendPrescriptions
*** [X] UpdatePrescriptionPharmacy
** [X] Document which services need pagination
*** [X] GetPatientPrescriptions
*** [X] SearchMedicationsByName
*** [X] SearchPharmacies
* Misc [4/5]
** [?] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4260][Unticketed PR]] to change SnoozeRequestMixin.missed_calls_count to be non-nullable
** [X] Remove feature flag for disabling DoseSpot API

** [X] models.Patient.has_synchronous_state can return None
This method should only ever return True or False
** [X] models.Patient.has_synchronous_state can cause memory leaks because of lru_cache
** [X] Un-fucking my local DB
*** [X] Copying migrations into the new migrations folder
:LOGBOOK:
CLOCK: [2024-08-26 Mon 17:22]--[2024-08-26 Mon 17:47] =>  0:25
:END:
** [ ] Validator to get the current provider
Morgan called this out [[https://github.com/hellowisp/secure.hellowisp.com/pull/4742#discussion_r1757271214][here]].
** [ ] data.convert_skus_to_cart_items() in the carts controller should be removed
I left a tech-debt comment about this ages ago. I /think/ what we did was moved from just SKUs to "cart items" to support attributes on each item. But we did not want to mess up "in flight" carts, so we left SKUs in the schemas and made this function to "convert" the SKUs into cart items. Obviously, we were supposed to delete the SKUs attribute and this conversion method, but I guess I never did.
* Editable Medications
** [X] WE-460: New Provider UI
** [X] Investigating UI failure for lab slips
- Note taken on [2024-08-27 Tue 07:06] \\
  Investigation lead to creation of WE-579
** [X] [[https://hellowisp.atlassian.net/browse/WISPENG-579][WISPENG-579]]
:LOGBOOK:
CLOCK: [2024-08-27 Tue 17:00]--[2024-08-27 Tue 18:27] =>  1:27
CLOCK: [2024-08-27 Tue 16:12]--[2024-08-27 Tue 16:37] =>  0:25
CLOCK: [2024-08-27 Tue 14:29]--[2024-08-27 Tue 15:27] =>  0:58
CLOCK: [2024-08-27 Tue 13:59]--[2024-08-27 Tue 14:24] =>  0:25
CLOCK: [2024-08-27 Tue 12:30]--[2024-08-27 Tue 12:42] =>  0:12
CLOCK: [2024-08-27 Tue 11:49]--[2024-08-27 Tue 12:14] =>  0:25
CLOCK: [2024-08-27 Tue 11:19]--[2024-08-27 Tue 11:44] =>  0:25
CLOCK: [2024-08-27 Tue 07:07]--[2024-08-27 Tue 07:32] =>  0:25
:END:
** NO Hotfix: old UI no longer updating FillRequests on Lab Slip submit
- Note taken on [2024-08-29 Thu 11:59] \\
  We probably don't need this. The new UI seems to be working fine.
:LOGBOOK:
CLOCK: [2024-08-29 Thu 09:05]--[2024-08-29 Thu 09:25] =>  0:20
:END:
** [?] Service method to get a Cart by ID
:PROPERTIES:
:DESCRIPTION: We need a service method to get carts by Cart ID. This will be used by the messaging system to display what changed in a user's cart.
:END:
:LOGBOOK:
CLOCK: [2024-08-29 Thu 16:45]--[2024-08-29 Thu 17:02] =>  0:17
CLOCK: [2024-08-29 Thu 16:13]--[2024-08-29 Thu 16:38] =>  0:25
:END:
** [-] WE-460 Tests
:LOGBOOK:
CLOCK: [2024-08-26 Mon 15:06]--[2024-08-26 Mon 15:31] =>  0:25
:END:
** [X] [[https://hellowisp.atlassian.net/browse/WISPENG-600][WISPENG-600]]: Issue with "Subscription renewal" text in new UI
:LOGBOOK:
CLOCK: [2024-09-04 Wed 06:53]--[2024-09-04 Wed 07:13] =>  0:20
CLOCK: [2024-09-03 Tue 15:02]--[2024-09-03 Tue 15:27] =>  0:25
CLOCK: [2024-09-03 Tue 11:37]--[2024-09-03 Tue 12:02] =>  0:25
:END:
** [X] [[https://hellowisp.atlassian.net/browse/WISPENG-603][WISPENG-603]]: Lab slips do not show if the Order is rejected first
:LOGBOOK:
CLOCK: [2024-09-12 Thu 16:56]--[2024-09-12 Thu 17:21] =>  0:25
CLOCK: [2024-09-12 Thu 08:42]--[2024-09-12 Thu 09:07] =>  0:25
CLOCK: [2024-09-12 Thu 08:07]--[2024-09-12 Thu 08:32] =>  0:25
CLOCK: [2024-09-11 Wed 16:30]--[2024-09-11 Wed 17:02] =>  0:32
CLOCK: [2024-09-11 Wed 16:04]--[2024-09-11 Wed 16:29] =>  0:25
CLOCK: [2024-09-11 Wed 15:25]--[2024-09-11 Wed 15:50] =>  0:25
CLOCK: [2024-09-11 Wed 14:55]--[2024-09-11 Wed 15:20] =>  0:25
CLOCK: [2024-09-11 Wed 13:58]--[2024-09-11 Wed 14:11] =>  0:13
CLOCK: [2024-09-11 Wed 11:40]--[2024-09-11 Wed 12:08] =>  0:28
CLOCK: [2024-09-11 Wed 11:15]--[2024-09-11 Wed 11:40] =>  0:25
CLOCK: [2024-09-10 Tue 17:30]--[2024-09-10 Tue 18:03] =>  0:33
CLOCK: [2024-09-10 Tue 16:12]--[2024-09-10 Tue 16:37] =>  0:25
CLOCK: [2024-09-10 Tue 06:36]--[2024-09-10 Tue 07:01] =>  0:25
CLOCK: [2024-09-09 Mon 17:20]--[2024-09-09 Mon 17:31] =>  0:11
CLOCK: [2024-09-09 Mon 16:55]--[2024-09-09 Mon 17:20] =>  0:25
CLOCK: [2024-09-09 Mon 15:55]--[2024-09-09 Mon 16:31] =>  0:36
CLOCK: [2024-09-09 Mon 15:29]--[2024-09-09 Mon 15:54] =>  0:25
CLOCK: [2024-09-09 Mon 14:54]--[2024-09-09 Mon 15:19] =>  0:25
CLOCK: [2024-09-09 Mon 14:17]--[2024-09-09 Mon 14:42] =>  0:25
CLOCK: [2024-09-09 Mon 12:45]--[2024-09-09 Mon 13:34] =>  0:49
CLOCK: [2024-09-09 Mon 12:04]--[2024-09-09 Mon 12:29] =>  0:25
CLOCK: [2024-09-09 Mon 11:30]--[2024-09-09 Mon 11:55] =>  0:25
CLOCK: [2024-09-09 Mon 10:48]--[2024-09-09 Mon 11:13] =>  0:25
CLOCK: [2024-09-09 Mon 10:06]--[2024-09-09 Mon 10:31] =>  0:25
CLOCK: [2024-09-06 Fri 12:26]--[2024-09-06 Fri 12:51] =>  0:25
CLOCK: [2024-09-05 Thu 15:05]--[2024-09-05 Thu 15:30] =>  0:25
CLOCK: [2024-09-05 Thu 13:49]--[2024-09-05 Thu 14:14] =>  0:25
CLOCK: [2024-09-05 Thu 11:10]--[2024-09-05 Thu 11:35] =>  0:25
CLOCK: [2024-09-05 Thu 10:44]--[2024-09-05 Thu 11:09] =>  0:25
CLOCK: [2024-09-05 Thu 09:05]--[2024-09-05 Thu 09:30] =>  0:25
CLOCK: [2024-09-04 Wed 20:27]--[2024-09-04 Wed 20:52] =>  0:25
CLOCK: [2024-09-04 Wed 18:15]--[2024-09-04 Wed 18:40] =>  0:25
CLOCK: [2024-09-04 Wed 17:44]--[2024-09-04 Wed 18:09] =>  0:25
CLOCK: [2024-09-04 Wed 16:15]--[2024-09-04 Wed 16:40] =>  0:25
CLOCK: [2024-09-04 Wed 15:29]--[2024-09-04 Wed 15:54] =>  0:25
CLOCK: [2024-09-04 Wed 14:19]--[2024-09-04 Wed 14:44] =>  0:25
CLOCK: [2024-09-04 Wed 09:55]--[2024-09-04 Wed 10:20] =>  0:25
CLOCK: [2024-09-04 Wed 09:15]--[2024-09-04 Wed 09:40] =>  0:25
CLOCK: [2024-09-03 Tue 17:21]--[2024-09-03 Tue 17:46] =>  0:25
CLOCK: [2024-09-03 Tue 16:51]--[2024-09-03 Tue 17:16] =>  0:25
CLOCK: [2024-09-03 Tue 15:54]--[2024-09-03 Tue 16:19] =>  0:25
:END:
*** NO PR to create the base schemas
Not doing this for now. We decided to duplicate the schemas until we've had a chance to talk about how we want to "share" schemas across services.
:LOGBOOK:
CLOCK: [2024-09-10 Tue 13:05]--[2024-09-10 Tue 13:30] =>  0:25
CLOCK: [2024-09-10 Tue 10:29]--[2024-09-10 Tue 10:54] =>  0:25
CLOCK: [2024-09-10 Tue 07:22]--[2024-09-10 Tue 07:47] =>  0:25
:END:
*** [X] Frontend UI improvements
:LOGBOOK:
CLOCK: [2024-09-12 Thu 10:41]--[2024-09-12 Thu 11:06] =>  0:25
:END:
*** [X] FIX: The Orders section is still loading the Lab Slips
*** [X] Frontend refactors
:LOGBOOK:
CLOCK: [2024-09-13 Fri 15:27]--[2024-09-13 Fri 15:52] =>  0:25
CLOCK: [2024-09-13 Fri 14:00]--[2024-09-13 Fri 14:25] =>  0:25
CLOCK: [2024-09-13 Fri 11:44]--[2024-09-13 Fri 12:09] =>  0:25
:END:
** [?] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4704][PR to get a Cart by ID]]
- Note taken on [2024-09-16 Mon 21:22] \\
  Just need to finish tests for this. The tricky part is mocking the Talon return values.
:LOGBOOK:
CLOCK: [2024-09-18 Wed 10:07]--[2024-09-23 Mon 10:43] => 120:36
CLOCK: [2024-09-18 Wed 09:33]--[2024-09-18 Wed 09:58] =>  0:25
CLOCK: [2024-09-18 Wed 08:30]--[2024-09-18 Wed 09:33] =>  1:03
CLOCK: [2024-09-17 Tue 16:48]--[2024-09-17 Tue 17:00] =>  0:12
CLOCK: [2024-09-17 Tue 15:15]--[2024-09-17 Tue 16:45] =>  1:30
CLOCK: [2024-09-17 Tue 14:37]--[2024-09-17 Tue 15:02] =>  0:25
CLOCK: [2024-09-17 Tue 13:49]--[2024-09-17 Tue 14:14] =>  0:25
CLOCK: [2024-09-17 Tue 13:00]--[2024-09-17 Tue 13:49] =>  0:49
CLOCK: [2024-09-17 Tue 12:23]--[2024-09-17 Tue 12:48] =>  0:25
CLOCK: [2024-09-17 Tue 11:36]--[2024-09-17 Tue 12:02] =>  0:26
CLOCK: [2024-09-17 Tue 11:00]--[2024-09-17 Tue 11:36] =>  0:36
CLOCK: [2024-09-17 Tue 08:22]--[2024-09-17 Tue 08:47] =>  0:25
CLOCK: [2024-09-17 Tue 07:35]--[2024-09-17 Tue 08:00] =>  0:25
CLOCK: [2024-09-16 Mon 18:30]--[2024-09-16 Mon 21:22] =>  2:52
CLOCK: [2024-09-16 Mon 14:38]--[2024-09-16 Mon 15:27] =>  0:49
CLOCK: [2024-09-16 Mon 11:45]--[2024-09-16 Mon 13:03] =>  1:18
:END:
** [-] [[https://hellowisp.atlassian.net/browse/WISPENG-466][WISPENG-466]]: Create and send dynamic message to patient in Secure for deny/approve
:LOGBOOK:
CLOCK: [2024-09-23 Mon 13:45]--[2024-09-23 Mon 14:10] =>  0:25
CLOCK: [2024-09-23 Mon 13:20]--[2024-09-23 Mon 13:45] =>  0:25
CLOCK: [2024-09-23 Mon 12:54]--[2024-09-23 Mon 13:19] =>  0:25
CLOCK: [2024-09-23 Mon 10:43]--[2024-09-23 Mon 11:08] =>  0:25
CLOCK: [2024-09-23 Mon 10:30]--[2024-09-23 Mon 10:43] =>  0:13
CLOCK: [2024-09-19 Thu 15:19]--[2024-09-19 Thu 15:44] =>  0:25
CLOCK: [2024-09-19 Thu 14:49]--[2024-09-19 Thu 15:14] =>  0:25
CLOCK: [2024-09-19 Thu 14:23]--[2024-09-19 Thu 14:48] =>  0:25
CLOCK: [2024-09-19 Thu 13:53]--[2024-09-19 Thu 14:18] =>  0:25
CLOCK: [2024-09-19 Thu 13:10]--[2024-09-19 Thu 13:35] =>  0:25
CLOCK: [2024-09-19 Thu 12:40]--[2024-09-19 Thu 13:05] =>  0:25
CLOCK: [2024-09-18 Wed 16:02]--[2024-09-18 Wed 16:27] =>  0:25
CLOCK: [2024-09-18 Wed 15:40]--[2024-09-18 Wed 16:02] =>  0:22
CLOCK: [2024-09-18 Wed 15:11]--[2024-09-18 Wed 15:36] =>  0:25
CLOCK: [2024-09-18 Wed 14:41]--[2024-09-18 Wed 15:06] =>  0:25
CLOCK: [2024-09-18 Wed 14:05]--[2024-09-18 Wed 14:30] =>  0:25
:END:
** [X] [[https://hellowisp.atlassian.net/browse/WISPENG-690][WISPENG-690 (Spike)]]: Investigate work required to support "pending" patients
:LOGBOOK:
CLOCK: [2024-09-24 Tue 12:50]--[2024-09-24 Tue 13:20] =>  0:30
CLOCK: [2024-09-23 Mon 15:08]--[2024-09-23 Mon 15:33] =>  0:25
CLOCK: [2024-09-23 Mon 14:35]--[2024-09-23 Mon 15:00] =>  0:25
:END:
** [-] Migration to add Proposed Carts table
:LOGBOOK:
CLOCK: [2024-09-25 Wed 15:30]--[2024-09-25 Wed 15:49] =>  0:19
CLOCK: [2024-09-25 Wed 13:35]--[2024-09-25 Wed 14:00] =>  0:25
CLOCK: [2024-09-25 Wed 13:00]--[2024-09-25 Wed 13:35] =>  0:35
:END:
** [-] Add Proposed Cart service method
:LOGBOOK:
CLOCK: [2024-09-25 Wed 16:00]--[2024-09-25 Wed 16:45] =>  0:45
CLOCK: [2024-09-25 Wed 15:10]--[2024-09-25 Wed 15:49] =>  0:39
CLOCK: [2024-09-25 Wed 14:44]--[2024-09-25 Wed 15:09] =>  0:25
CLOCK: [2024-09-25 Wed 14:00]--[2024-09-25 Wed 14:10] =>  0:10
:END:
* Messages to post
** [ ] Ask in dev-private what everyone thinks about the type hint for returning "Self" from Pydantic validators.
We have two options:
- return ~typing_extensions.Self~
- return the same class name in quotes.

It doesn't /really/ matter much, but we should pick one and stick with it.

Note that ~Self~ is part of ~typing~ as of Python 3.11, but for now, we need to use ~typing_extensions~. Only mentioning this in case your IDE suggests importing from ~typing~ (mine did).

* Tests
** [ ] Move tests in tests/api/v3
These tests are misplaced. They should be in tests/app/controllers/api/v3
** [X] ProductFactory.description should not be None
The DB does not have the column as nullabe, so this should not be ~None~ by default.
** [X] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4740][Patient.has_synchronous_state can be None]]
:LOGBOOK:
CLOCK: [2024-09-10 Tue 17:15]--[2024-09-10 Tue 17:24] =>  0:09
CLOCK: [2024-09-10 Tue 16:44]--[2024-09-10 Tue 17:09] =>  0:25
:END:
This should only ever be True or False, but it can be None. Write a test to expose this behavior and fix it.
** [X] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4753][Add PLR0917 to exceptions list for new test suite]]
This is "Too many positional arguments". When you have a lot of stuff you need to mock, this makes no sense.

* Things to do for others
** [ ] Look at WISPENG-467 and WISPENG-468 and see if they can be broken down. Let Kristin know.
